import ChanyBg from "@/assets/entertainment/chany/chany-bg.jpg";

import ChanSolodkaMytiImg from "@/assets/entertainment/chany/solodka-myti-chan.jpg";
import Chan2Img from "@/assets/entertainment/chany/chan-2.jpg";
import ChanDreamImg from "@/assets/entertainment/chany/chan-dream.jpg";
import KarpatskyChanImg from "@/assets/entertainment/chany/karpatsky-chan.jpg";
import RandevuChanImg from "@/assets/entertainment/chany/randevu-chan.jpg";
import ChanProstir65Img from "@/assets/entertainment/chany/prostir-65.jpg";

import MountainSkiingBg from "@/assets/entertainment/mountain-skiing/mountain-skiing-bg.jpg";

import MountainBikeBg from "@/assets/entertainment/bike-mountain.jpg";

import SpaBg from "@/assets/entertainment/spa.jpg";

export const entertainmants = [
  {
    id: 0,
    title: "Чани",
    description: `
        Це давній спосіб відпочинку, який знайшов своє застосування в
        українській культурі як символ релаксації та оздоровлення. Ці
        невеликі дерев'яні будиночки, часто розташовані на березі річок
        або озер, стали популярними місцями для проведення часу в
        природі та відпочинку від міської суєти. В чанах можна
        насолодитися теплом парової бані, яка є невід'ємною частиною
        української банної процедури. Традиційно, в чані
        використовуються натуральні ароматичні трави, які надають пару
        приємним ароматом та допомагають розслабитися. Це місце, де
        можна забути про щоденні турботи, насолодитися спокоєм природи і
        відновити своє тіло і душу. Після відвідування чану багато людей
        відчувають оновлення, відпочинок і заряд енергії на наступний
        день. Запрошуємо вас відкрити для себе цю традиційну українську
        форму відпочинку і насолодитися моментами спокою та гармонії в
        обрамленні природи.`,
    img: ChanyBg,
    places: [
      {
        id: 0,
        title: `Чан, Сауна "Солодка мить"`,
        address: "вулиця Олени Степанівни, 49, Славське",
        img: ChanSolodkaMytiImg,
        link: "https://maps.app.goo.gl/Aqt6cdV7BAhtCtHY9",
      },
      {
        id: 1,
        title: `Чан`,
        address: "вулиця Довбуша, 8, Славське",
        img: Chan2Img,
        link: "https://maps.app.goo.gl/tyhidLzz7fqVpfX7A",
      },
      {
        id: 2,
        title: `Чан DREAM`,
        address: "вулиця Волошина, 3, Славське",
        img: ChanDreamImg,
        link: "https://maps.app.goo.gl/XtsfbzgycYVJnHHVA",
      },
      {
        id: 3,
        title: `Карпатський Чан`,
        address: "вулиця Устияновича, 70ж, Славське",
        img: KarpatskyChanImg,
        link: "https://maps.app.goo.gl/BEAsNZ6DXdFzUgTH7",
      },
      {
        id: 4,
        title: `Чан Славське «Рандеву»`,
        address: "вулиця Тараса Шевченка, 105, Славське",
        img: RandevuChanImg,
        link: "https://maps.app.goo.gl/yuUuH5RrjH1jpNd2A",
      },
      {
        id: 5,
        title: `PROSTIR 65`,
        address: "вулиця Устияновича, 65, Славське",
        img: ChanProstir65Img,
        link: "https://maps.app.goo.gl/DP1knAyKiP8tXz8S7",
      },
    ],
  },
  {
    id: 1,
    title: "Гірськолижний відпочинок",
    description: `Славсько — це одне з найбільш популярних гірськолижних курортів в Україні, розташоване в серці Карпат, 
    що забезпечує чудові умови для зимового відпочинку та катання на лижах. Це місце, де поєднуються чарівні карпатські пейзажі, 
    сучасні траси та традиційна українська гостинність.
    На території Славсько розташовано декілька трас різного рівня складності, що підходять як для початківців, так і
     для досвідчених лижників. Крім того, на курорті працюють школи лижного спорту та прокат спорядження, де ви зможете 
     взяти все необхідне для катання на лижах або сноуборді.    
     Локації гірськолижних трас в Славсько можуть бути розташовані на різних склонах навколо селища. Ось деякі з них та їх приблизні розташування:
     Траса "Тростян": Зазвичай розташована на східних схилах гори Тростян, яка знаходиться неподалік від центру селища.
     Траса "Зелена": Ця траса часто розташована біля східного кінця Славсько, на схилах, що охоплюють вулицю Підгірна.
     Траса "Червона": Розташована на заходній частині Славсько, на схилах, які ведуть до вершини гори Високий Верх.
     Траса "Чорна": Зазвичай це одна з найвищих трас, яка може бути розташована на схилах гори Троїцька, біля західного кінця селища.
     Дитяча траса: Часто знаходиться біля основних гірськолижних трас, але спеціально відведена для безпечного катання маленьких лижників, часто в районі головної бази курорту.   
    Запрошуємо вас відкрити для себе неперевершені карпатські краєвиди, активно провести час на трасах та насолодитися 
    гостинністю Славська, яке чекає на вас з відкритими обіймами на протязі всього зимового сезону!`,
    img: MountainSkiingBg,
    places: [],
  },
  {
    id: 2,
    title: "Велоспорт",
    description: `Славсько також відоме своїми велосипедними маршрутами, які пропонують чудові можливості для активного відпочинку в горах. Різноманітні велосипедні маршрути прокладені через красиві карпатські ліси, гірські потоки та панорамні видовища,
    дозволяючи насолоджуватися природою на повну катушку.
    Основні типи велосипедних маршрутів, які доступні у Славсько:
    Гірські веломаршрути: Ці маршрути пропонують вибір відносно технічно складних та адреналіном наповнених трас, які пролягають через ліси та потоки, до більш легких маршрутів з панорамними краєвидами.
    Треки для MTB (Mountain Bike): Для любителів гірського велосипеду є спеціальні траси з перепадами висот, крутими спусками та виглядами, які забезпечують незабутні враження.
    Веломаршрути для дорожніх велосипедів: Для тих, хто віддає перевагу шосейному велосипеду, є маршрути, які пролягають через живописні дорожки та асфальтовані дороги, дозволяючи насолоджуватися красою карпатських пейзажів на велосипеді.
    Більшість готелів та курортів у Славсько пропонують прокат велосипедів та організовані велосипедні екскурсії. Також можна знайти інструкторів та гідів, які допоможуть вам обрати маршрут відповідно до вашого рівня підготовки та бажань.    
    Відвідуючи Славсько для велоспорту, ви отримаєте відмінну можливість не тільки для активного відпочинку, але й для відкриття неперевершених карпатських пейзажів на двоколісному другу.`,
    img: MountainBikeBg,
    places: [],
  },
  {
    id: 3,
    title: "Сауни та спа-процедури",
    description: `Тут ви також зможете насолодитися релаксуючими саунами та спа-процедурами, щоб відновити своє тіло після активного відпочинку на природі. Багато готелів, курортів та баз відпочинку пропонують високоякісні спа-послуги та саунні комплекси для своїх гостей.
    Традиційні сауни: Більшість місць пропонують класичні фінські сауни, де ви зможете відчути глибоке розслаблення, очистити шкіру та підвищити імунітет.
    Бані: Для тих, хто цінує українські традиції, доступні бані з березовим віником, які допоможуть покращити кровообіг, розслабити м'язи та підвищити тонус організму.
    Спа-процедури: Ви зможете вибрати з багатого асортименту спа-процедур, включаючи масажі, обгортання та догляд за обличчям, які допоможуть вам відновити енергію, покращити красу та відчути гармонію з собою.
    Басейни: Більшість спа-центрів мають також великі басейни, де ви зможете плавати, розслабитися та насолодитися водними процедурами.
    Зона відпочинку: Після сауни чи спа-процедур вас чекає зона відпочинку з комфортними лежаками та чаєм, де ви зможете провести час в спокої, розмовляючи або читаючи книгу.
    Будь ласка, зверніть увагу, що деталі та асортимент послуг можуть відрізнятися в залежності від конкретного готелю або курорту. Рекомендується заздалегідь ознайомитися з пропозиціями та забронювати час для спа-процедур, особливо в пікові сезони.`,
    img: SpaBg,
    places: [],
  },
];
