import TrostianImg from "@/assets/mountains/trostian.jpg";
import VysokyiVerkhImg from "@/assets/mountains/vysokyi-verkh.jpg";
import TatarivkaImg from "@/assets/mountains/tatarivka.jpg";
import MahuraImg from "@/assets/mountains/magura.jpg";
import IlzaImg from "@/assets/mountains/ilsa.jpg";

export const mountains = [
  {
    title: "Гора Тростян",
    text: "Гора Тростян є однією з найвищих вершин у Карпатах, що оточує Славсько. Її висота над рівнем моря створює захоплюючі панорами, з яких видно не тільки саме селище, але й річку та гори вдалині. Ця гора приваблює не лише за красою природи, а й за різноманітні можливості для активного відпочинку. Для любителів активного відпочинку Тростян пропонує гірськолижні траси та велосипедні маршрути різної складності. Це відмінне місце для піших прогулянок і зимових видів спорту. Літній період тут вражає своєю зеленню, а зима — сніжним покривом і чистим повітрям.",
    img: TrostianImg,
  },
  {
    title: "Гора Високий Верх",
    text: "Гора Високий Верх відома своїми неймовірними лісовими маршрутами та панорамними видами на Карпати. Ця гора є місцем, де природа і спорт об'єднуються в ідеальному співвідношенні. Проходячи серед столітніх дерев, можна відчути спокій і гармонію з природою. Високий Верх також славиться своїми треками для гірського велосипеду та спортивними трасами для лижників. Ця гора пропонує різноманітні маршрути для будь-якого рівня підготовки. Незалежно від сезону, Високий Верх завжди радує своїми природними красами.",
    img: VysokyiVerkhImg,
  },
  {
    title: "Гора Татарівка",
    text: "Гора Татарівка — це місце, де природа і людина живуть у гармонії. Ця гора відома своєю лісистою місцевістю та простими маршрутами, які ідеально підходять для сімейних прогулянок. Ці мальовничі місця відчуваються як справжній рай для піших прогулянок. Найлегший маршрут зі Славська на гору Татарівка має протяжність всього 8 км. По дорозі можна насолодитися лісовими пейзажами, а в літній період — зібрати солодкі ягоди прямо з кущів. Татарівка — це місце, де можна відпочити від міської метушні і насолодитися природою в її чистому вигляді.",
    img: TatarivkaImg,
  },
  {
    title: "Гора Магура",
    text: "Гора Магура пропонує своїм відвідувачам маршрути, які ведуть через різноманітні пейзажі та зелені ліси. Ця гора відома своєю різноманітністю та красою, яка зачаровує кожного туриста. Маршрут на Магуру має загальну протяжність у 18 км, тому він ідеально підійде для тих, хто шукає трохи більше пригоди. Ця гора надає можливість насолодитися природними красами, відчути спокій і відпочити від міської метушні.",
    img: MahuraImg,
  },
  {
    title: "Гора Ільза",
    text: "Гора Ільза є однією з найбільш доступних гір для туристів. З цієї гори відкриваються неперевершені панорами на Карпати та навколишні гори. Це ідеальне місце для тих, хто шукає простий і приємний маршрут для піших прогулянок. Маршрут на Ільзу має середню складність з протяжністю від 8,7 до 10 км. Початок маршруту розташований у самому центрі Славська, що робить його дуже зручним для туристів. Цей маршрут надає можливість не тільки насолодитися природними красами, але й відчути спокій і гармонію з навколишнім світом.",
    img: IlzaImg,
  },
];
